bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n18a.h
#define PIN_PB08B_ADC0_AIN2                        (40L)        
#define MUX_PB08B_ADC0_AIN2                        (1L)        
#define PINMUX_PB08B_ADC0_AIN2                     ((PIN_PB08B_ADC0_AIN2 << 16) | MUX_PB08B_ADC0_AIN2)
#define PORT_PB08B_ADC0_AIN2                       ((1UL) << 8)

#define PIN_PB09B_ADC0_AIN3                        (41L)        
#define MUX_PB09B_ADC0_AIN3                        (1L)        
#define PINMUX_PB09B_ADC0_AIN3                     ((PIN_PB09B_ADC0_AIN3 << 16) | MUX_PB09B_ADC0_AIN3)
#define PORT_PB09B_ADC0_AIN3                       ((1UL) << 9)

#define PIN_PA04B_ADC0_AIN4                        (4L)         
#define MUX_PA04B_ADC0_AIN4                        (1L)        
#define PINMUX_PA04B_ADC0_AIN4                     ((PIN_PA04B_ADC0_AIN4 << 16) | MUX_PA04B_ADC0_AIN4)
#define PORT_PA04B_ADC0_AIN4                       ((1UL) << 4)

#define PIN_PA05B_ADC0_AIN5                        (5L)         
#define MUX_PA05B_ADC0_AIN5                        (1L)        
#define PINMUX_PA05B_ADC0_AIN5                     ((PIN_PA05B_ADC0_AIN5 << 16) | MUX_PA05B_ADC0_AIN5)
#define PORT_PA05B_ADC0_AIN5                       ((1UL) << 5)

#define PIN_PA06B_ADC0_AIN6                        (6L)         
#define MUX_PA06B_ADC0_AIN6                        (1L)        
#define PINMUX_PA06B_ADC0_AIN6                     ((PIN_PA06B_ADC0_AIN6 << 16) | MUX_PA06B_ADC0_AIN6)
#define PORT_PA06B_ADC0_AIN6                       ((1UL) << 6)

#define PIN_PA07B_ADC0_AIN7                        (7L)         
#define MUX_PA07B_ADC0_AIN7                        (1L)        
#define PINMUX_PA07B_ADC0_AIN7                     ((PIN_PA07B_ADC0_AIN7 << 16) | MUX_PA07B_ADC0_AIN7)
#define PORT_PA07B_ADC0_AIN7                       ((1UL) << 7)

#define PIN_PC00B_ADC0_AIN8                        (64L)        
#define MUX_PC00B_ADC0_AIN8                        (1L)        
#define PINMUX_PC00B_ADC0_AIN8                     ((PIN_PC00B_ADC0_AIN8 << 16) | MUX_PC00B_ADC0_AIN8)
#define PORT_PC00B_ADC0_AIN8                       ((1UL) << 0)

#define PIN_PC01B_ADC0_AIN9                        (65L)        
#define MUX_PC01B_ADC0_AIN9                        (1L)        
#define PINMUX_PC01B_ADC0_AIN9                     ((PIN_PC01B_ADC0_AIN9 << 16) | MUX_PC01B_ADC0_AIN9)
#define PORT_PC01B_ADC0_AIN9                       ((1UL) << 1)

#define PIN_PC02B_ADC0_AIN10                       (66L)        
#define MUX_PC02B_ADC0_AIN10                       (1L)        
#define PINMUX_PC02B_ADC0_AIN10                    ((PIN_PC02B_ADC0_AIN10 << 16) | MUX_PC02B_ADC0_AIN10)
#define PORT_PC02B_ADC0_AIN10                      ((1UL) << 2)

#define PIN_PC03B_ADC0_AIN11                       (67L)        
#define MUX_PC03B_ADC0_AIN11                       (1L)        
#define PINMUX_PC03B_ADC0_AIN11                    ((PIN_PC03B_ADC0_AIN11 << 16) | MUX_PC03B_ADC0_AIN11)
#define PORT_PC03B_ADC0_AIN11                      ((1UL) << 3)

#define PIN_PA03B_ADC0_VREFP                       (3L)         
#define MUX_PA03B_ADC0_VREFP                       (1L)        
#define PINMUX_PA03B_ADC0_VREFP                    ((PIN_PA03B_ADC0_VREFP << 16) | MUX_PA03B_ADC0_VREFP)
#define PORT_PA03B_ADC0_VREFP                      ((1UL) << 3)

/* ========== PORT definition for ADC1 peripheral ========== */
#define PIN_PB00B_ADC1_AIN0                        (32L)        
#define MUX_PB00B_ADC1_AIN0                        (1L)        
#define PINMUX_PB00B_ADC1_AIN0                     ((PIN_PB00B_ADC1_AIN0 << 16) | MUX_PB00B_ADC1_AIN0)
#define PORT_PB00B_ADC1_AIN0                       ((1UL) << 0)

#define PIN_PB01B_ADC1_AIN1                        (33L)        
#define MUX_PB01B_ADC1_AIN1                        (1L)        
#define PINMUX_PB01B_ADC1_AIN1                     ((PIN_PB01B_ADC1_AIN1 << 16) | MUX_PB01B_ADC1_AIN1)
#define PORT_PB01B_ADC1_AIN1                       ((1UL) << 1)

#define PIN_PB02B_ADC1_AIN2                        (34L)        
#define MUX_PB02B_ADC1_AIN2                        (1L)        
#define PINMUX_PB02B_ADC1_AIN2                     ((PIN_PB02B_ADC1_AIN2 << 16) | MUX_PB02B_ADC1_AIN2)
#define PORT_PB02B_ADC1_AIN2                       ((1UL) << 2)

#define PIN_PB03B_ADC1_AIN3                        (35L)        
#define MUX_PB03B_ADC1_AIN3                        (1L)        
#define PINMUX_PB03B_ADC1_AIN3                     ((PIN_PB03B_ADC1_AIN3 << 16) | MUX_PB03B_ADC1_AIN3)
#define PORT_PB03B_ADC1_AIN3                       ((1UL) << 3)

#define PIN_PB08B_ADC1_AIN4                        (40L)        
#define MUX_PB08B_ADC1_AIN4                        (1L)        
#define PINMUX_PB08B_ADC1_AIN4                     ((PIN_PB08B_ADC1_AIN4 << 16) | MUX_PB08B_ADC1_AIN4)
#define PORT_PB08B_ADC1_AIN4                       ((1UL) << 8)

#define PIN_PB09B_ADC1_AIN5                        (41L)        
#define MUX_PB09B_ADC1_AIN5                        (1L)        
#define PINMUX_PB09B_ADC1_AIN5                     ((PIN_PB09B_ADC1_AIN5 << 16) | MUX_PB09B_ADC1_AIN5)
#define PORT_PB09B_ADC1_AIN5                       ((1UL) << 9)

#define PIN_PB04B_ADC1_AIN6                        (36L)        
#define MUX_PB04B_ADC1_AIN6                        (1L)        
#define PINMUX_PB04B_ADC1_AIN6                     ((PIN_PB04B_ADC1_AIN6 << 16) | MUX_PB04B_ADC1_AIN6)
#define PORT_PB04B_ADC1_AIN6                       ((1UL) << 4)

#define PIN_PB05B_ADC1_AIN7                        (37L)        
#define MUX_PB05B_ADC1_AIN7                        (1L)        
#define PINMUX_PB05B_ADC1_AIN7                     ((PIN_PB05B_ADC1_AIN7 << 16) | MUX_PB05B_ADC1_AIN7)
#define PORT_PB05B_ADC1_AIN7                       ((1UL) << 5)

#define PIN_PB06B_ADC1_AIN8                        (38L)        
#define MUX_PB06B_ADC1_AIN8                        (1L)        
#define PINMUX_PB06B_ADC1_AIN8                     ((PIN_PB06B_ADC1_AIN8 << 16) | MUX_PB06B_ADC1_AIN8)
#define PORT_PB06B_ADC1_AIN8                       ((1UL) << 6)

#define PIN_PB07B_ADC1_AIN9                        (39L)        
#define MUX_PB07B_ADC1_AIN9                        (1L)        
#define PINMUX_PB07B_ADC1_AIN9                     ((PIN_PB07B_ADC1_AIN9 << 16) | MUX_PB07B_ADC1_AIN9)
#define PORT_PB07B_ADC1_AIN9                       ((1UL) << 7)

#define PIN_PA08B_ADC1_AIN10                       (8L)         
#define MUX_PA08B_ADC1_AIN10                       (1L)        
#define PINMUX_PA08B_ADC1_AIN10                    ((PIN_PA08B_ADC1_AIN10 << 16) | MUX_PA08B_ADC1_AIN10)
#define PORT_PA08B_ADC1_AIN10                      ((1UL) << 8)

#define PIN_PA09B_ADC1_AIN11                       (9L)         
#define MUX_PA09B_ADC1_AIN11                       (1L)        
#define PINMUX_PA09B_ADC1_AIN11                    ((PIN_PA09B_ADC1_AIN11 << 16) | MUX_PA09B_ADC1_AIN11)
#define PORT_PA09B_ADC1_AIN11                      ((1UL) << 9)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PA23G_CAN0_RX                          (23L)        
#define MUX_PA23G_CAN0_RX                          (6L)        
#define PINMUX_PA23G_CAN0_RX                       ((PIN_PA23G_CAN0_RX << 16) | MUX_PA23G_CAN0_RX)
#define PORT_PA23G_CAN0_RX                         ((1UL) << 23)

#define PIN_PA25G_CAN0_RX                          (25L)        
#define MUX_PA25G_CAN0_RX                          (6L)        
#define PINMUX_PA25G_CAN0_RX                       ((PIN_PA25G_CAN0_RX << 16) | MUX_PA25G_CAN0_RX)
#define PORT_PA25G_CAN0_RX                         ((1UL) << 25)

#define PIN_PA22G_CAN0_TX                          (22L)        
#define MUX_PA22G_CAN0_TX                          (6L)        
#define PINMUX_PA22G_CAN0_TX                       ((PIN_PA22G_CAN0_TX << 16) | MUX_PA22G_CAN0_TX)
#define PORT_PA22G_CAN0_TX                         ((1UL) << 22)

#define PIN_PA24G_CAN0_TX                          (24L)        
#define MUX_PA24G_CAN0_TX                          (6L)        
#define PINMUX_PA24G_CAN0_TX                       ((PIN_PA24G_CAN0_TX << 16) | MUX_PA24G_CAN0_TX)
#define PORT_PA24G_CAN0_TX                         ((1UL) << 24)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PB13G_CAN1_RX                          (45L)        
#define MUX_PB13G_CAN1_RX                          (6L)        
#define PINMUX_PB13G_CAN1_RX                       ((PIN_PB13G_CAN1_RX << 16) | MUX_PB13G_CAN1_RX)
#define PORT_PB13G_CAN1_RX                         ((1UL) << 13)

#define PIN_PB15G_CAN1_RX                          (47L)        
#define MUX_PB15G_CAN1_RX                          (6L)        
#define PINMUX_PB15G_CAN1_RX                       ((PIN_PB15G_CAN1_RX << 16) | MUX_PB15G_CAN1_RX)
#define PORT_PB15G_CAN1_RX                         ((1UL) << 15)

#define PIN_PB12G_CAN1_TX                          (44L)        
#define MUX_PB12G_CAN1_TX                          (6L)        
#define PINMUX_PB12G_CAN1_TX                       ((PIN_PB12G_CAN1_TX << 16) | MUX_PB12G_CAN1_TX)
#define PORT_PB12G_CAN1_TX                         ((1UL) << 12)

#define PIN_PB14G_CAN1_TX                          (46L)        
#define MUX_PB14G_CAN1_TX                          (6L)        
#define PINMUX_PB14G_CAN1_TX                       ((PIN_PB14G_CAN1_TX << 16) | MUX_PB14G_CAN1_TX)
#define PORT_PB14G_CAN1_TX                         ((1UL) << 14)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04I_CCL_IN0                          (4L)         
#define MUX_PA04I_CCL_IN0                          (8L)        
#define PINMUX_PA04I_CCL_IN0                       ((PIN_PA04I_CCL_IN0 << 16) | MUX_PA04I_CCL_IN0)
#define PORT_PA04I_CCL_IN0                         ((1UL) << 4)

