bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n18a.h
#define PIN_PA21B_PTC_X9                           (21L)        
#define MUX_PA21B_PTC_X9                           (1L)        
#define PINMUX_PA21B_PTC_X9                        ((PIN_PA21B_PTC_X9 << 16) | MUX_PA21B_PTC_X9)
#define PORT_PA21B_PTC_X9                          ((1UL) << 21)

#define PIN_PA22B_PTC_X10                          (22L)        
#define MUX_PA22B_PTC_X10                          (1L)        
#define PINMUX_PA22B_PTC_X10                       ((PIN_PA22B_PTC_X10 << 16) | MUX_PA22B_PTC_X10)
#define PORT_PA22B_PTC_X10                         ((1UL) << 22)

#define PIN_PA23B_PTC_X11                          (23L)        
#define MUX_PA23B_PTC_X11                          (1L)        
#define PINMUX_PA23B_PTC_X11                       ((PIN_PA23B_PTC_X11 << 16) | MUX_PA23B_PTC_X11)
#define PORT_PA23B_PTC_X11                         ((1UL) << 23)

#define PIN_PB12B_PTC_X12                          (44L)        
#define MUX_PB12B_PTC_X12                          (1L)        
#define PINMUX_PB12B_PTC_X12                       ((PIN_PB12B_PTC_X12 << 16) | MUX_PB12B_PTC_X12)
#define PORT_PB12B_PTC_X12                         ((1UL) << 12)

#define PIN_PB13B_PTC_X13                          (45L)        
#define MUX_PB13B_PTC_X13                          (1L)        
#define PINMUX_PB13B_PTC_X13                       ((PIN_PB13B_PTC_X13 << 16) | MUX_PB13B_PTC_X13)
#define PORT_PB13B_PTC_X13                         ((1UL) << 13)

#define PIN_PB14B_PTC_X14                          (46L)        
#define MUX_PB14B_PTC_X14                          (1L)        
#define PINMUX_PB14B_PTC_X14                       ((PIN_PB14B_PTC_X14 << 16) | MUX_PB14B_PTC_X14)
#define PORT_PB14B_PTC_X14                         ((1UL) << 14)

#define PIN_PB15B_PTC_X15                          (47L)        
#define MUX_PB15B_PTC_X15                          (1L)        
#define PINMUX_PB15B_PTC_X15                       ((PIN_PB15B_PTC_X15 << 16) | MUX_PB15B_PTC_X15)
#define PORT_PB15B_PTC_X15                         ((1UL) << 15)

#define PIN_PA02B_PTC_Y0                           (2L)         
#define MUX_PA02B_PTC_Y0                           (1L)        
#define PINMUX_PA02B_PTC_Y0                        ((PIN_PA02B_PTC_Y0 << 16) | MUX_PA02B_PTC_Y0)
#define PORT_PA02B_PTC_Y0                          ((1UL) << 2)

#define PIN_PA03B_PTC_Y1                           (3L)         
#define MUX_PA03B_PTC_Y1                           (1L)        
#define PINMUX_PA03B_PTC_Y1                        ((PIN_PA03B_PTC_Y1 << 16) | MUX_PA03B_PTC_Y1)
#define PORT_PA03B_PTC_Y1                          ((1UL) << 3)

#define PIN_PA04B_PTC_Y2                           (4L)         
#define MUX_PA04B_PTC_Y2                           (1L)        
#define PINMUX_PA04B_PTC_Y2                        ((PIN_PA04B_PTC_Y2 << 16) | MUX_PA04B_PTC_Y2)
#define PORT_PA04B_PTC_Y2                          ((1UL) << 4)

#define PIN_PA05B_PTC_Y3                           (5L)         
#define MUX_PA05B_PTC_Y3                           (1L)        
#define PINMUX_PA05B_PTC_Y3                        ((PIN_PA05B_PTC_Y3 << 16) | MUX_PA05B_PTC_Y3)
#define PORT_PA05B_PTC_Y3                          ((1UL) << 5)

#define PIN_PA06B_PTC_Y4                           (6L)         
#define MUX_PA06B_PTC_Y4                           (1L)        
#define PINMUX_PA06B_PTC_Y4                        ((PIN_PA06B_PTC_Y4 << 16) | MUX_PA06B_PTC_Y4)
#define PORT_PA06B_PTC_Y4                          ((1UL) << 6)

#define PIN_PA07B_PTC_Y5                           (7L)         
#define MUX_PA07B_PTC_Y5                           (1L)        
#define PINMUX_PA07B_PTC_Y5                        ((PIN_PA07B_PTC_Y5 << 16) | MUX_PA07B_PTC_Y5)
#define PORT_PA07B_PTC_Y5                          ((1UL) << 7)

#define PIN_PB00B_PTC_Y6                           (32L)        
#define MUX_PB00B_PTC_Y6                           (1L)        
#define PINMUX_PB00B_PTC_Y6                        ((PIN_PB00B_PTC_Y6 << 16) | MUX_PB00B_PTC_Y6)
#define PORT_PB00B_PTC_Y6                          ((1UL) << 0)

#define PIN_PB01B_PTC_Y7                           (33L)        
#define MUX_PB01B_PTC_Y7                           (1L)        
#define PINMUX_PB01B_PTC_Y7                        ((PIN_PB01B_PTC_Y7 << 16) | MUX_PB01B_PTC_Y7)
#define PORT_PB01B_PTC_Y7                          ((1UL) << 1)

#define PIN_PB02B_PTC_Y8                           (34L)        
#define MUX_PB02B_PTC_Y8                           (1L)        
#define PINMUX_PB02B_PTC_Y8                        ((PIN_PB02B_PTC_Y8 << 16) | MUX_PB02B_PTC_Y8)
#define PORT_PB02B_PTC_Y8                          ((1UL) << 2)

#define PIN_PB03B_PTC_Y9                           (35L)        
#define MUX_PB03B_PTC_Y9                           (1L)        
#define PINMUX_PB03B_PTC_Y9                        ((PIN_PB03B_PTC_Y9 << 16) | MUX_PB03B_PTC_Y9)
#define PORT_PB03B_PTC_Y9                          ((1UL) << 3)

#define PIN_PB04B_PTC_Y10                          (36L)        
#define MUX_PB04B_PTC_Y10                          (1L)        
#define PINMUX_PB04B_PTC_Y10                       ((PIN_PB04B_PTC_Y10 << 16) | MUX_PB04B_PTC_Y10)
#define PORT_PB04B_PTC_Y10                         ((1UL) << 4)

#define PIN_PB05B_PTC_Y11                          (37L)        
#define MUX_PB05B_PTC_Y11                          (1L)        
#define PINMUX_PB05B_PTC_Y11                       ((PIN_PB05B_PTC_Y11 << 16) | MUX_PB05B_PTC_Y11)
#define PORT_PB05B_PTC_Y11                         ((1UL) << 5)

#define PIN_PB06B_PTC_Y12                          (38L)        
#define MUX_PB06B_PTC_Y12                          (1L)        
#define PINMUX_PB06B_PTC_Y12                       ((PIN_PB06B_PTC_Y12 << 16) | MUX_PB06B_PTC_Y12)
#define PORT_PB06B_PTC_Y12                         ((1UL) << 6)

#define PIN_PB07B_PTC_Y13                          (39L)        
#define MUX_PB07B_PTC_Y13                          (1L)        
#define PINMUX_PB07B_PTC_Y13                       ((PIN_PB07B_PTC_Y13 << 16) | MUX_PB07B_PTC_Y13)
#define PORT_PB07B_PTC_Y13                         ((1UL) << 7)

#define PIN_PB08B_PTC_Y14                          (40L)        
#define MUX_PB08B_PTC_Y14                          (1L)        
#define PINMUX_PB08B_PTC_Y14                       ((PIN_PB08B_PTC_Y14 << 16) | MUX_PB08B_PTC_Y14)
#define PORT_PB08B_PTC_Y14                         ((1UL) << 8)

#define PIN_PB09B_PTC_Y15                          (41L)        
#define MUX_PB09B_PTC_Y15                          (1L)        
#define PINMUX_PB09B_PTC_Y15                       ((PIN_PB09B_PTC_Y15 << 16) | MUX_PB09B_PTC_Y15)
#define PORT_PB09B_PTC_Y15                         ((1UL) << 9)

#define PIN_PA08B_PTC_Y16                          (8L)         
#define MUX_PA08B_PTC_Y16                          (1L)        
#define PINMUX_PA08B_PTC_Y16                       ((PIN_PA08B_PTC_Y16 << 16) | MUX_PA08B_PTC_Y16)
#define PORT_PA08B_PTC_Y16                         ((1UL) << 8)

#define PIN_PA09B_PTC_Y17                          (9L)         
#define MUX_PA09B_PTC_Y17                          (1L)        
#define PINMUX_PA09B_PTC_Y17                       ((PIN_PA09B_PTC_Y17 << 16) | MUX_PA09B_PTC_Y17)
#define PORT_PA09B_PTC_Y17                         ((1UL) << 9)

#define PIN_PA10B_PTC_Y18                          (10L)        
#define MUX_PA10B_PTC_Y18                          (1L)        
#define PINMUX_PA10B_PTC_Y18                       ((PIN_PA10B_PTC_Y18 << 16) | MUX_PA10B_PTC_Y18)
#define PORT_PA10B_PTC_Y18                         ((1UL) << 10)

#define PIN_PA11B_PTC_Y19                          (11L)        
#define MUX_PA11B_PTC_Y19                          (1L)        
#define PINMUX_PA11B_PTC_Y19                       ((PIN_PA11B_PTC_Y19 << 16) | MUX_PA11B_PTC_Y19)
#define PORT_PA11B_PTC_Y19                         ((1UL) << 11)

#define PIN_PA16B_PTC_Y20                          (16L)        
#define MUX_PA16B_PTC_Y20                          (1L)        
#define PINMUX_PA16B_PTC_Y20                       ((PIN_PA16B_PTC_Y20 << 16) | MUX_PA16B_PTC_Y20)
#define PORT_PA16B_PTC_Y20                         ((1UL) << 16)

#define PIN_PA17B_PTC_Y21                          (17L)        
#define MUX_PA17B_PTC_Y21                          (1L)        
#define PINMUX_PA17B_PTC_Y21                       ((PIN_PA17B_PTC_Y21 << 16) | MUX_PA17B_PTC_Y21)
#define PORT_PA17B_PTC_Y21                         ((1UL) << 17)

#define PIN_PA18B_PTC_Y22                          (18L)        
#define MUX_PA18B_PTC_Y22                          (1L)        
#define PINMUX_PA18B_PTC_Y22                       ((PIN_PA18B_PTC_Y22 << 16) | MUX_PA18B_PTC_Y22)
#define PORT_PA18B_PTC_Y22                         ((1UL) << 18)

#define PIN_PA19B_PTC_Y23                          (19L)        
#define MUX_PA19B_PTC_Y23                          (1L)        
#define PINMUX_PA19B_PTC_Y23                       ((PIN_PA19B_PTC_Y23 << 16) | MUX_PA19B_PTC_Y23)
#define PORT_PA19B_PTC_Y23                         ((1UL) << 19)

#define PIN_PA20B_PTC_Y24                          (20L)        
#define MUX_PA20B_PTC_Y24                          (1L)        
#define PINMUX_PA20B_PTC_Y24                       ((PIN_PA20B_PTC_Y24 << 16) | MUX_PA20B_PTC_Y24)
#define PORT_PA20B_PTC_Y24                         ((1UL) << 20)

#define PIN_PA21B_PTC_Y25                          (21L)        
#define MUX_PA21B_PTC_Y25                          (1L)        
#define PINMUX_PA21B_PTC_Y25                       ((PIN_PA21B_PTC_Y25 << 16) | MUX_PA21B_PTC_Y25)
#define PORT_PA21B_PTC_Y25                         ((1UL) << 21)

#define PIN_PA22B_PTC_Y26                          (22L)        
#define MUX_PA22B_PTC_Y26                          (1L)        
#define PINMUX_PA22B_PTC_Y26                       ((PIN_PA22B_PTC_Y26 << 16) | MUX_PA22B_PTC_Y26)
#define PORT_PA22B_PTC_Y26                         ((1UL) << 22)

#define PIN_PA23B_PTC_Y27                          (23L)        
#define MUX_PA23B_PTC_Y27                          (1L)        
#define PINMUX_PA23B_PTC_Y27                       ((PIN_PA23B_PTC_Y27 << 16) | MUX_PA23B_PTC_Y27)
#define PORT_PA23B_PTC_Y27                         ((1UL) << 23)

